<pad>
<unk>
<start>
<end>
,
.
the
in
de
a
of
si
to
and
sa
@-@
ca
la
that
is
pentru
&quot;
din
care
for
o
cu
on
este
i
this
we
un
nu
are
as
it
european
(
)
mai
be
pe
-
with
have
au
se
will
&apos;s
by
not
va
al
which
am
/
an
at
has
acest
aceasta
trebuie
sunt
ar
ce
fost
fi
eu
from
:
also
ue
would
all
but
was
s
president
ale
its
prin
important
our
their
been
should
commission
said
sau
&apos;
kosovo
must
more
member
there
they
union
states
ne
%
privind
mr
--
or
parliament
toate
you
vor
asemenea
can
new
?
europene
one
europeana
fie
europe
countries
lucru
these
daca
economic
serbia
le
report
us
;
ceea
dintre
membre
trebui
people
who
do
very
declarat
&#91;
about
&#93;
asupra
international
foarte
other
he
intr
like
state
acestea
unei
dupa
cele
need
so
euro
if
country
what
aceste
only
mod
dar
council
time
support
re@@
europa
because
presedinte
cum
acesta
mult
unui
however
exista
up
faptul
rights
between
policy
ani
comisiei
no
noi
comisia
were
cadrul
iar
timp
my
poate
special
statele
government
area
political
year
politica
such
acord
now
putea
catre
into
when
fata
astfel
out
social
acum
mare
insa
el
minister
two
cand
some
uniunea
doua
intre
times
face
agreement
doar
against
multe
public
first
dle
his
despre
dori
tara
financial
precum
work
deoarece
impotriva
urmare
uniunii
national
than
pana
those
cel
therefore
munca
bih
crisis
take
lor
ati
make
tari
ii
privire
citizens
many
parlamentul
them
well
development
years
energy
problema
k@@
macedonia
priveste
cat
market
cred
avem
croatia
parte
in@@
made
being
10
general
after
world
over
pot
ate
s@@
urma
southeast
alte
most
isi
fara
security
way
believe
human
any
g@@
last
data
vom
acestui
setimes
future
nato
inca
vedere
under
could
raport
atat
l
had
avea
measures
turkey
order
situation
romania
d@@
cea
bulgaria
think
parlamentului
unor
part
issue
tarile
group
say
cei
primul
lui
consider
during
o@@
see
acestei
loc
nivel
nevoie
importanta
today
i@@
may
right
11
1
stat
even
economica
p@@
both
de@@
consiliului
z@@
reprezinta
afirmat
albania
where
criza
same
decat
process
noastre
sector
able
law
ci
raportul
l@@
how
2009
level
members
vote
b@@
asa
masuri
just
fact
ata
possible
ul
foreign
piata
system
use
economice
still
rand
luni
ei
putem
n@@
sale
through
good
commissioner
presedintele
ensure
since
prime
c@@
ne@@
h@@
debate
un@@
chiar
t@@
while
12
party
v@@
20
trade
want
clear
ma
baza
domeniul
aplicare
end
omului
much
does
within
atunci
dna
resolution
ai
drepturile
plan
t
guvernul
proposal
here
es
protection
nou
deja
place
doresc
e
cannot
continue
procesul
2010
astazi
already
democratic
voted
votat
prezent
j@@
budget
dezvoltare
facut
high
ului
region
fiind
including
m@@
ia
potrivit
favoarea
u@@
case
turcia
action
e@@
common
help
statelor
drepturilor
celor
particular
three
strategy
trei
long
il
000
number
cooperation
putin
situatia
partea
according
treaty
an@@
avut
without
committee
presedinta
y@@
co
politice
ministrul
m
ar@@
global
consiliul
2
timpul
recent
information
anul
bine
al@@
totusi
madam
issues
legal
question
why
noua
tot
nici
before
favour
next
er
parlament
spus
directive
bosnia
serbian
en@@
authorities
probleme
change
institutions
point
clar
noastra
women
role
2008
persoane
cauza
economy
me
your
dl
peste
hope
respect
financiare
domnule
inainte
buna
aici
own
scris
problems
know
drept
tuturor
progress
cazul
comisar
numai
continua
co@@
areas
f@@
based
er@@
decision
community
set
acestor
current
ing
ele
then
2020
siguranta
problem
desi
transport
needs
belgrade
regional
externe
punct
securitate
necessary
too
told
control
moment
major
cateva
given
a@@
una
local
30
put
unul
sub
united
greece
15
cetatenilor
towards
better
acelasi
suntem
turkish
nationale
taken
cetatenii
3
w@@
particularly
fapt
d
course
fel
exemplu
multumesc
asigura
thank
perioada
internationale
el@@
final
onu
dezvoltarea
ro@@
05
arii
masura
multi
inclusiv
operation
st@@
programme
09
further
crime
impact
negotiations
publice
per
euros
mi
06
privinta
viitor
means
07
rules
fundamental
da
pristina
images
unite
mea
autoritatile
framework
acestora
presidency
example
mari
media
milioane
court
ea
r@@
growth
ti@@
tarii
free
getty
come
regulation
former
prima
orice
unele
sociale
europei
referitoare
membru
08
at@@
04
give
permite
efforts
health
among
increase
c
numele
provide
reuters
fiecare
another
meeting
03
k
war
power
incat
trecut
whether
acordul
crestere
lisbon
importante
day
police
freedom
lisabona
initiative
nostru
2007
ed
terms
again
conditions
li@@
view
ch@@
funds
include
afp
far
business
result
climate
gentlemen
ladies
afla
services
different
relations
talks
aproximativ
zi
ales
term
25
5
domnilor
regard
am@@
grecia
together
legate
agree
food
mrs
afaceri
u
implementation
toti
im@@
unde
uri
doamna
doamnelor
adopted
great
making
27
used
working
position
europeni
elections
every
acestia
as@@
legatura
real
small
writing
politicii
bank
aceea
alta
second
sectorul
resources
legislation
become
propunerea
instrument
il@@
access
pre@@
did
go
specific
montenegro
...
it@@
says
million
companies
democracy
sprijinul
let
fund
parties
faca
2011
standards
cresterea
products
project
key
following
welcome
era
8
eur
various
ministru
plus
eaza
calitate
going
ra@@
locuri
di@@
rapporteur
printre
cooperare
caz
4
certain
especially
policies
regiune
luna
money
third
children
necesare
workers
investment
research
reduce
termen
main
belgrad
week
impreuna
doilea
dreptul
zona
integration
sprijin
informatii
news
comune
opportunity
bun
cooperarea
dis@@
step
effective
done
or@@
politic
meu
posibil
serious
deal
approach
6
em@@
she
aid
spune
importance
act
months
called
avand
force
sper
stability
house
ul@@
date
border
lupta
nivelul
context
down
matter
ic
po@@
y
energie
russia
inceput
asistenta
basis
spun
education
grupului
few
eforturile
greater
call
aspect
fac
forward
ri@@
aproape
full
si@@
intrucat
greek
voi
2006
safety
find
mici
razboi
eficienta
comisie
central
accession
crearea
is@@
several
problemele
agency
comuna
viata
inseamna
legislative
eze
anului
military
currently
non
cultural
17
yet
get
opinion
industry
society
actiune
direct
justice
back
7
on@@
sistem
taking
once
nuclear
18
do@@
each
ag@@
internet
zile
responsibility
extrem
allow
bo@@
aiba
internationala
con@@
her
best
summit
vederea
single
solution
grupul
create
reform
conform
ilor
mediu
13
agenda
masurile
jobs
ari
financiar
prea
billion
large
agreements
sarb
scopul
due
strong
rule
positive
directiva
protectia
intreaga
saptamana
difficult
adevarat
p
fight
so@@
facem
officials
least
motiv
life
civil
2004
proposals
ab@@
start
situatie
anumite
behalf
16
potential
china
to@@
fully
employment
conflict
internal
essential
ma@@
ac@@
less
centre
open
ation
joint
sociala
mar@@
lume
est
prim
financiara
necesar
bune
politici
sua
diferite
office
tratatul
results
sud
declara
whole
ori
re
cent
14
private
sfarsitul
rol
sens
mn
monday
account
procedura
aderare
interne
serbiei
achieve
saying
total
significant
50
doi
rezolutie
dezbatere
interests
et@@
clearly
ask
reforms
majority
interest
guvernului
held
spre
crizei
although
se@@
improve
3@@
around
croatian
fortei
move
december
month
finally
confrunta
nostri
rusia
attention
period
crimes
present
dorim
decembrie
regions
pare
ajuta
sistemul
expected
acesteia
v
pas
groups
projects
really
miliarde
ci@@
tarilor
march
something
partidul
august
raportului
initiativa
proces
solidarity
oameni
peace
cases
herzegovina
proposed
vi@@
strategic
albanian
service
bring
management
pozitia
ic@@
19@@
ex@@
quality
fundamentale
environment
membership
assistance
june
mo@@
dumneavoastra
martie
ago
text
environmental
independent
tax
subject
barroso
lo@@
past
capital
iunie
ko@@
patru
elor
four
agricultural
climatice
status
pro@@
pune
muntenegru
violence
dlui
adevar
having
inter@@
nicio
pietei
ica
wednesday
9
anti
reason
aspecte
young
sustainable
labour
personal
until
dialogue
g
oamenii
production
miercuri
domeniu
affairs
desigur
urile
24
left
momentul
aderarea
z
led
things
risk
gas
always
en
02
ad@@
rolul
ur@@
dvs.
january
tadic
off
cadru
minutes
majoritatea
leaders
objectives
involved
rather
h
ianuarie
agreed
crucial
sofia
opposition
document
punerea
ramane
itself
needed
procedure
21
succes
esential
ofera
rs
conformitate
ap
poata
2@@
40
prezenta
continuare
cohesion
chestiune
concerns
five
institutiile
2005
principle
defence
consumers
protectie
added
company
considerare
hand
probabil
october
corruption
!
adoptat
investitii
look
acestuia
ec
conditiile
cinci
vorba
dat
partidului
octombrie
mentionat
ile
lung
parti
schengen
23
funding
ers
meet
markets
independence
macedonian
activitatea
referitor
africa
ala
rapid
propunere
remain
conference
often
locale
pl@@
imi
01
turciei
met
19
modul
lack
propuneri
trecuta
ana
partnership
viitorul
concerned
him
relatiile
produse
serie
guvern
representative
ie
oferi
necesara
lu@@
par@@
republic
november
regarding
22
competition
line
comerciale
presa
ina
punctul
sources
acordului
tuesday
presedintia
points
statement
100
independenta
posibilitatea
zagreb
noiembrie
activities
concrete
parliamentary
decizia
vo@@
challenges
vot
balkans
comun
reducerea
transparency
marti
r
external
su@@
ita
n
raspuns
visit
lumea
commitment
evident
proiectul
review
2013
toata
conditii
cerut
wish
tirana
arata
fi@@
indeed
responsible
utilizarea
schimb
population
developing
solicita
credit
28
ite
curs
others
curand
changes
organised
show
salut
bugetul
numarul
urmeaza
focus
days
locul
systems
sp@@
ated
soon
marea
es@@
programmes
26
western
pay
verbal
strategia
lipsa
hertegovina
solutie
securitatea
adoptarea
inceputul
unii
alegerile
aim
subliniez
priority
noul
ankara
numar
poverty
words
dezbaterea
proiect
ministry
concerning
per@@
nord
costs
april
programul
fr
urilor
la@@
doreste
despite
announced
administrative
istanbul
thursday
aprilie
actuala
provided
libertatea
atentia
amendments
niciun
representatives
negocierile
ec@@
obiectivele
rate
increased
available
package
victims
primit
th@@
plans
atentie
afirma
joi
concern
cetateni
ashton
natural
post
seen
femeilor
economiei
south
individual
republica
form
bulgarian
culture
luat
response
july
ciuda
objective
b
opinia
pl
discutiile
abordare
vedea
anuntat
regulamentul
tratatului
organisation
go@@
randul
eficient
ant
promote
acordat
votul
regiunea
prevent
vigoare
sase
six
decisions
iulie
actually
reports
prezentat
gu@@
enough
serb
took
reforma
february
av@@
signed
sustine
deplin
afara
multa
visa
publica
energetica
festival
februarie
4@@
articolul
election
sustin
job
procesului
alt
forma
sarajevo
official
lead
leader
forces
addition
imbunatatirea
creation
sh@@
considera
subiect
cost
press
economia
sistemului
living
criminal
necesitatea
cursul
governments
skopje
membri
reusit
ho@@
remains
car@@
diverse
extremely
ajuns
principles
romanian
september
domenii
erdogan
ultimii
aduce
mladic
anume
ka
motive
bu@@
septembrie
obiectivul
pace
60
german
intampla
calea
decizie
exprimat
tribunal
comes
ap@@
ver@@
across
statului
deputati
simply
amendment
event
viitoare
legislatia
transparenta
cercetare
externa
bi@@
innovation
devenit
doing
ut@@
thus
guarantee
play
roma
nations
ha@@
agriculture
singura
found
along
film
brussels
inalt
man@@
principal
head
increasing
close
ajutor
centrul
andu
join
ent@@
persoanelor
man
combaterea
balkan
businesses
efficiency
aimed
fondurile
500
values
mentioned
received
5@@
castigat
early
above
director
voting
ethnic
benefit
mediului
mondial
cyprus
eforturi
illegal
com@@
schimbarile
ed@@
ministers
complet
chestiuni
old
subliniat
bruxelles
requirements
ara
practice
organisations
criteria
governance
vital
surse
ot@@
asigure
questions
29
sea
osce
using
stim
conferinta
address
semnat
&apos;t
protect
no@@
specifice
thing
consumatorilor
instruments
consolidarea
bani
cazuri
short
zone
contribui
unfortunately
active
ceva
enterprises
os
top
fondul
negocierilor
simplu
muncii
strategie
won
actions
recently
obiectiv
li
obiective
idea
ali
te
draft
consiliu
age
iran
achieved
chief
banca
integrarea
fellow
ev@@
fim
though
tra@@
north
intotdeauna
appropriate
ent
institutii
pt
field
procedures
scurt
training
coeziune
contextul
similar
existing
quite
reached
men
2012
reasons
belarus
model
lua
ere
servicii
refera
progrese
coming
totii
additional
pus
ajutorul
compromise
eg@@
alegeri
reprezentant
altor
implement
consequences
farmers
understand
fair
ati@@
longer
om@@
strengthen
referendum
uniune
acorda
aware
financing
bilateral
building
home
ru@@
promovarea
presedintiei
dezvoltarii
everyone
program
priorities
produselor
decide
required
urgenta
accesul
solutii
min@@
themselves
pressure
established
application
instead
obtine
negative
faptului
ator
democrat
responsabilitatea
fonduri
sure
establish
x@@
prices
certainly
discutii
f
develop
serviciile
reach
puternic
regionale
mi@@
noile
adaugat
cooperarii
might
supported
ambele
curtea
finantare
oficialii
opportunities
medium
true
ren@@
sub@@
pi@@
finance
decided
rehn
family
kind
air
germany
infrastructure
success
regulations
sarbi
energiei
ever
road
american
7@@
acolo
constituie
ating
proiecte
energetice
ultimul
ultimele
putut
valoare
asked
adoption
autoritatilor
1@@
pleased
gh@@
turc
asadar
asiguram
apoi
membrii
2003
candidate
tourism
produce
steps
throughout
borders
ajunge
persoanele
serbs
intentioneaza
sanatate
duminica
aceeasi
mission
oil
technical
sunday
mon@@
previous
ice
regime
mondiala
ensuring
low
departe
rezolutia
liber
croat
ja
int@@
keep
hi@@
lucruri
nationala
little
cross
drepturi
democratice
dintr
aplicarea
planul
whose
liderii
unemployment
almost
everything
du@@
list
movement
8@@
discuss
femei
bar@@
terte
eastern
centrala
nimic
31
expect
um@@
comunitatea
sai
constitutional
slovenia
incheiat
construction
alliance
saptamani
crea
ten
included
article
gi@@
mechanism
industria
ce@@
association
ni@@
red
incepe
affected
share
et
perspectiva
realizat
carried
contribution
related
monitoring
declaratie
be@@
value
never
consumer
actiuni
alternative
effort
initial
permanent
annual
administration
competitiveness
italy
city
intreprinderile
finantarea
nothing
implemented
le@@
quickly
return
acorduri
east
intermediul
firstly
committed
ridicat
matters
justitie
civile
pur
vest
rezultat
tocmai
brought
athens
earlier
interna
asteapta
scop
grave
printr
statul
presedintelui
contribuie
naturale
outside
suficient
propus
ak@@
ine
partners
france
stiu
rezultate
fo@@
effect
unmik
hard
sch@@
levels
ant@@
prioritate
populatiei
vizita
offer
corect
varsta
br@@
rezultatele
later
czech
moldova
itate
receive
debt
calls
6@@
copii
perhaps
democrats
introduce
boris
mine
cuvinte
providing
institutiilor
deveni
ahead
stabilitate
ban
makes
securitatii
80
came
accept
weeks
agricole
mean
asylum
implementing
contribute
speak
price
israel
pacate
intra
est@@
terrorism
budgetary
creating
kostunica
complete
huge
ski
adopt
luate
basic
intrebare
and@@
expressed
name
au@@
sti@@
mil@@
banks
indoiala
resurse
bineinteles
history
laws
feel
decis
ora
comunitatii
deosebit
agricultura
discrimination
cal@@
parteneriat
serviciilor
secondly
request
violenta
improving
intalnit
team
devina
erii
cl@@
niciodata
ly
demand
behind
express
ro
strengthening
pozitie
supply
germania
apply
cheie
sitting
approved
structural
domestic
fisheries
politicile
closed
discussion
rezultatul
nucleare
aflat
bugetului
presented
leave
standardele
powers
ti
langa
diplomatic
intreprinderilor
water
cu@@
secretary
rural
seful
2002
introducerea
capacity
existat
ruling
side
ez
bosnian
provinciei
sfarsit
implementarea
numeroase
grup
copiilor
iti
bl@@
radio
stand
unit
atie
popular
practica
venit
solutions
necesita
vic
urgent
ta@@
regulament
existente
balcani
ations
stress
ing@@
events
suplimentare
discuta
stop
equal
lege
recovery
trafficking
produsele
mass
acces
opening
higher
washington
regiuni
af@@
solidaritate
live
talking
implica
relation
cut
socialist
enable
200
discussed
provisions
aplica
encourage
forta
emissions
duce
ready
tip
experts
fostul
ind
buget
interesul
pozitiv
italia
regionala
competitive
ovic
respectarea
democratie
goods
tribunalul
atoare
goal
treatment
1995
fondurilor
ideea
balance
imediat
friday
reduction
esentiala
relatiilor
1999
eri
daily
materie
za
companii
politicians
actual
tr@@
treilea
technology
srpska
gra@@
cor@@
mei
actiunile
evaluare
semnificativ
curtii
atii
opened
.@@
message
permiteti
assessment
nl
datelor
avoid
agentia
majore
aspects
confidence
puncte
zece
half
skopie
apel
build
facute
late
datorita
tu@@
vizeaza
relevant
lista
70
ireland
considered
anti@@
populatia
resurselor
run
rata
standard
initiatives
mandate
facing
str@@
negocieri
obtinut
hungarian
imf
incredere
sized
humanitarian
ordinea
decizii
light
strategiei
prevede
eulex
situatiei
totodata
relating
putere
b92
lunii
fmi
vineri
kfor
ber@@
compania
authority
leading
femeile
sprijini
durabila
adoptate
canada
mind
waste
experience
urmatorul
cre@@
known
puternica
numara
talk
effects
macedoniei
sectors
icty
asigurarea
2001
juridic
interesele
dez@@
legislatiei
land
excellent
element
mediterranean
rea
organizate
supporting
compromis
minority
directia
celelalte
jo@@
includes
puna
lives
vorbim
maritime
solicitat
gen
globala
northern
benefits
industrial
ambitious
angajamentul
russian
op@@
possibility
georgia
ultima
campaign
regards
motion
entire
creste
progresul
rating
oamenilor
promoting
death
oficial
documents
respecta
amount
entry
created
deputy
communication
crescut
ofere
akp
cresterii
wants
legea
saraievo
investments
comisarul
eficiente
comertului
provides
principalele
ukraine
ju@@
successful
lot
arile
austria
posibila
religious
exchange
shown
atena
luam
convention
organizat
societatii
sustinut
hold
hu
oferit
participa
developed
eu@@
principiul
resursele
seama
zi@@
ally
dovada
democratiei
cere
aprobat
cultura
enlargement
cont
ministerul
vice
transparent
mijlocii
reglementare
capacitatea
away
challenge
intrebarea
lucrurile
instrumente
paid
incearca
constitution
green
exact
2000
sanatatii
completely
begin
carbon
g20
statements
overall
integrare
croatiei
fishing
army
reprezentantii
parlamentare
directivei
efficient
travel
ea@@
atori
beginning
situatii
absolutely
imm
politia
perspective
deficit
either
thanks
furthermore
minorities
italian
ante
try
apararii
abordarea
calling
felicit
trying
euro@@
turn
coordination
direction
activitatile
libera
sk@@
stage
pkk
standarde
erea
draw
meanwhile
shall
prepared
america
coalition
franta
communities
participation
colleagues
garanta
capat
sectorului
zonele
liderul
prezinta
seems
clara
contact
economies
statutul
des
fl@@
can@@
ta
schimbarilor
veti
j
takes
reala
politie
caused
jumatate
dnei
milosevic
ol@@
cuvant
mii
looking
establishing
mention
teritoriul
destul
vizelor
bbc
effectively
sense
agencies
carora
sar@@
condus
zoran
educatie
iz@@
imbunatati
tomorrow
moreover
wanted
stabilit
ve
institutional
ai@@
experienta
karadzic
largest
justitiei
itatea
unica
sigur
pescuitului
pa@@
fiscal
lucratorilor
failed
politicilor
alegerilor
odata
nikola
pact
ity
organizata
cale
globale
careia
combating
economie
afecteaza
intreprinderi
az@@
culturale
delegation
written
network
task
ac
aims
ahtisaari
poor
existe
export
har@@
militare
declaratia
van
azil
indiferent
congratulate
solicit
me@@
limita
motivul
propunerile
adesea
energia
big
intrebari
actuale
legii
clare
hague
abil
discutat
echipa
reg@@
self
alti
km
totul
altele
analiza
minimum
answer
comprehensive
french
grupuri
stabilitatea
interes
coruptiei
usor
rise
discutie
discussions
applied
reality
mondiale
anual
adecvate
giving
bugetare
represents
generale
reducere
requires
controlul
cur@@
ban@@
em
language
beyond
pachet
goals
haga
ov@@
maine
speaker
90
follow
shows
speech
regret
refer
consecinta
sarcina
participat
sansa
thousands
discutam
session
banii
declaratii
lumii
reducing
urmatoarele
pietele
statutului
adoptata
gaze
inc@@
opozitie
calitatea
arilor
orasul
opt
factor
deci
cul@@
regiunile
sign
sprijina
structurale
eliminarea
irlanda
x
chestiunea
mor@@
limba
inregistrat
nature
juridice
raised
companiile
discutiilor
deschis
9@@
provocari
implicate
ourselves
reformele
mu@@
greciei
dialog
usd
fondului
relatii
publicatiei
hungary
ates
british
saraciei
activitati
ko
organizatiei
ability
families
35
improved
absolut
gdp
domnul
anii
pe@@
measure
majoritate
happen
india
are@@
permita
tri@@
investitiile
conduce
acela
equality
colegii
ting
property
recognise
asteptam
threat
immigration
combat
aspectele
site
namely
te@@
growing
vietii
lost
adresa
ni
centrale
pib
natura
esentiale
incheierea
george
university
stabilirea
maintain
primi
productia
puse
commitments
atia
bancii
copenhagen
over@@
300
politiei
represent
dificil
likely
targets
acordurile
presei
degraba
fiscale
bilaterale
0@@
influence
copenhaga
sto@@
reforme
costurile
fortele
concurenta
bucharest
ways
for@@
profit
heard
online
nor
forum
christian
basescu
dispute
st
functie
item
middle
adopte
ist@@
ki
masurilor
romaniei
activity
macedonean
commercial
near
mer@@
started
libertate
iraq
cause
carry
stabilite
problemelor
anterior
partidele
nevoia
allowed
principala
adecvat
alimentare
elected
scientific
proper
smes
programului
comertul
closely
mele
caruia
dpa
promis
nation
monetary
tunisia
quoted
staff
incepand
bulgariei
plant
erau
sides
difficulties
ucraina
conclusion
reported
approval
gul
ir@@
cuvantul
test
failure
school
pri@@
tii
nimeni
abile
unacceptable
functioning
marii
attacks
arrest
sta
rapida
complex
dificila
speranta
raportor
val@@
intended
fe@@
establishment
aratat
closer
pro
ene
infrastructura
declaration
adopta
generala
larga
propune
nearly
dorit
dreptate
lucreaza
grec
principiile
alaturi
productie
co2
consideram
judicial
gasi
nevertheless
europeans
jovanovic
intrarea
cererea
mecanism
acts
durata
depuse
programe
greu
ts
vrea
province
vazut
impactul
ter@@
achieving
boost
realiza
patients
chamber
influenta
existenta
vota
supraveghere
trust
speram
disaster
ph@@
launched
sine
sanader
libertatii
obligations
ura
cativa
propriile
origin
gar@@
multor
ded
ocuparea
acesti
participarea
ans
ative
tine
transportul
extindere
round
responsabilitate
speaking
pescuit
obiectivelor
depinde
proiectului
nucleara
tratat
comercial
pakistan
dreptului
cap
strongly
vad
study
producers
continues
seven
persons
dezbateri
inaintea
practices
easca
realizarea
pericol
stanga
realitate
fer@@
asia
atul
involvement
gestiune
gestionarea
ism
majora
pat@@
king
proteja
becoming
refugees
raspunsul
afectate
ri
atlantic
immediately
$
noted
introduction
acorde
ou@@
latest
efect
lea
upon
sarbe
pacii
ist
minoritatilor
traficului
ad
detine
mediul
bat@@
protejarea
recognition
149
integrated
scazut
tabled
directly
fighting
partid
alimentara
increasingly
dispozitie
pierdut
armata
comert
note
comunitar
child
ocazia
ds
datoria
societatea
copiii
globalisation
res@@
anta
procedurile
spirit
masa
sef
dea
sic
ted
trial
origine
chance
merita
intamplat
srebrenica
sapte
extinderea
pozitive
cont@@
elaborat
fall
mechanisms
modern
he@@
terorismului
ungaria
accordance
path
haiti
customs
persoana
activ
suma
knowledge
guvernele
mal@@
science
lower
board
republicii
ang@@
submitted
secretarul
tell
semnificative
substantial
progres
partner
urged
starting
respecte
depus
esc
critical
setting
singur
highest
propunerii
ong
lansat
rates
normele
intai
gender
fosta
ppe
parerea
tur@@
recommendations
followed
aj
tarziu
enter
developments
schimbare
constructive
raise
w
ridica
circumstances
nordul
regulamentului
gaza
eight
stiinta
democratica
thaci
mica
emphasise
natiunilor
grava
send
discharge
muntenegrului
lt
scale
ali@@
spain
ra
territory
propuse
normal
technologies
alone
votes
trebuit
parts
protocol
planned
convenit
recognised
cr@@
aprobarea
require
tayyip
agentiei
respectiv
privitoare
cypriot
sufficient
operations
credem
increderea
somajului
ties
recep
gruevski
primele
damage
rest
positions
prioritatile
cine
transfer
medical
product
ones
ov
investigation
albaniei
domeniile
qu@@
albanez
operate
infiintarea
consecintele
corecta
economii
kosovari
respond
liberal
connection
bloc
specifically
aceleasi
institution
evaluarea
traditional
person
introduced
umane
forms
atorii
ore
consolida
doubt
dreapta
via
scope
tar@@
car
societate
preturilor
corespunzator
acele
reduced
traiesc
norme
politics
sistemele
precisely
provision
del
ridicate
raspunde
bucuresti
limited
enta
record
20@@
oficiali
apa
seriously
subliniaza
utilizate
punem
deschiderea
tv
sk
caror
activitate
ay@@
vedem
concept
sent
bodies
trans@@
camera
straine
centru
principalul
ob@@
ivo
risks
libya
consumatorii
target
ramana
goes
premierul
fin@@
separate
legislativ
income
exercitiu
began
mesaj
75
adus
bil@@
dialogul
parere
energetic
invest
southern
sarba
charges
biggest
simple
series
duty
creat
sal@@
guvernanta
competenta
pan@@
spanish
seek
victime
assembly
tic
reale
balcanii
faced
fic@@
ft
bazeaza
je
demonstrat
secure
ocazie
prevention
reformelor
cs
mat@@
sa@@
managed
planning
linked
highly
etnice
strict
criteriile
yes
directorul
resolve
mutual
tre@@
acp
average
territorial
tineri
confruntam
electoral
extent
informare
worth
oral
serios
vorbit
operational
consensus
paper
sc@@
town
evidence
contine
civila
elaborarea
evita
yugoslavia
helping
der
itatii
orasului
mas@@
problemei
ane
aparare
ramas
youth
manner
schimbari
obtinerea
sanctions
col@@
albanians
crize
sprijine
obviously
immediate
son
ks
mandat
deputatii
rezolutiei
integrarii
exprim
spent
bel@@
improvement
partide
mentinerea
views
igor
altii
legislatie
speciale
rec@@
fond
turci
zonei
differences
terrorist
works
puternice
issued
roman
industriei
natiuni
figures
properly
bulgar
gr@@
bid
sustinerea
gives
outcome
spending
dus
ten@@
cate
rezolutii
bringing
counterpart
stressed
remember
im
asta
kovic
medicale
participate
eti
burden
serviciul
migration
impune
prezentate
protecting
rapporteurs
constant
structures
1992
demands
meps
contract
membra
schimba
electricity
balanced
alimente
adequate
liberalisation
disponibile
petrol
aflate
consultati
ente
students
seeking
stie
york
numerous
ground
presupune
promova
ratko
valori
legi
spera
dorinta
textile
relationship
forced
payments
ongoing
obama
angajament
tehnice
facilitate
valorile
supervision
cer@@
vreme
iau
produs
leadership
interior
legata
corespunzatoare
strasbourg
accepta
berisha
purpose
poland
mis@@
continued
deplina
mainly
practici
asociere
sanatatea
ge
parcursul
kar@@
efectele
mobile
solana
wrong
&amp;
serve
ram@@
happened
ast@@
citat
strategii
san@@
conclusions
urmatoarea
permis
inf@@
um
ous
minute
propria
considerat
inv@@
piete
passengers
leg@@
ser@@
kosovar
cerintele
tinerilor
uni@@
bal@@
ga
budgets
voice
stiti
raman
elements
journalists
pr@@
tim@@
competente
companiilor
vojislav
uitam
ferm
standardelor
attack
pachetul
ili@@
puterea
dealing
professional
irish
principiu
bucura
coordonare
sur@@
carui
amendamente
whom
afghanistan
demonstreaza
prevenirea
anumitor
atorilor
monitorizare
administratia
freedoms
finala
regiunii
conturi
aeriene
expression
mandatul
firm
animal
mobility
pol@@
albanezi
raportorul
incercat
tions
lin@@
passed
negotiating
juridica
spania
conflicts
organizatia
body
summer
safe
table
saturday
lider
proceduri
belgradul
cam@@
compared
adding
practical
ziua
sprijinirea
textul
equipment
recunoscut
rezolva
discussing
summitul
mentine
stated
singurul
sexual
excelenta
functionarea
type
lic@@
us@@
id@@
militara
olli
stabili
hit
rau
informatiile
des@@
rog
continuing
exist
suficiente
aj@@
renewable
published
guarantees
confirmed
responsabil
add
ulterior
sel@@
sambata
democratia
presus
organizatii
functioneaza
sursa
vine
rejected
asking
probably
partile
solicitam
moneda
overcome
eni
oase
revizuirea
supports
black
precedent
rii
ings
conclude
noilor
prezinte
solidaritatea
informat
protest
1990
nine
gener@@
net
locurile
easy
granted
arrested
pen@@
recunoasterea
respective
18@@
grupurile
performance
investitiilor
reprezenta
reflecta
unice
emisiilor
misiunea
inteleg
repede
worked
comments
forget
na
proiectele
similare
consideration
celui
eforturilor
impiedica
sprijinit
choice
rapoarte
crima
presence
ilegale
moartea
guvernamant
guidelines
aderarii
conditiilor
ef@@
bor@@
ern@@
companiei
acordarea
dovedit
pozitiva
attempt
individuale
amendamentele
prosecutor
domnului
tion
all@@
implicarea
ment
bugetar
barbati
oficiala
monitor
cover
fr@@
uk
ponte
iti@@
plants
ba@@
poporului
trece
speciala
instrumentele
sport
elemente
lucratorii
investors
convinced
anything
nabucco
fortelor
ministrii
directe
noului
wide
libia
poporul
buildings
recente
religioase
istoria
tinerii
animalelor
pas@@
privatisation
her@@
penal
adecvata
mark
troops
crede
solutionarea
oportunitati
tackle
cipru
healthcare
cabinet
situations
voters
omologul
charter
puteti
acquis
pu@@
welcomed
tema
understanding
mijlociu
diferitele
ses
une
described
itati
victimelor
source
indeplinirea
operating
addressed
banking
currency
activitatii
ajunga
risc
respins
deciziile
auditors
400
conducted
scrise
macar
incheia
programele
stronger
changed
recunoaste
intervention
armed
propose
res
pietelor
slobodan
emergency
organizarea
meetings
putting
portugal
binding
unic
aliantei
island
applause
shared
wi@@
japan
structure
ceha
sometimes
gre@@
oportunitate
sed
contribuit
restul
regimului
vulnerable
britanie
vointa
cap@@
accounts
stable
electronic
beneficia
ah@@
killed
mit@@
aerian
voturi
maximum
acea
african
45
institute
dezvolta
transition
anyone
ir
podgorica
jan@@
ling
agricola
celei
responsibilities
uneori
polonia
ay
islamic
indeplini
otherwise
violations
contributia
azi
jucat
auzit
revizuire
mesic
aplauze
went
permit
affect
montenegrin
contributie
destinate
speed
atiile
cer
altfel
ori@@
sin@@
accident
century
swedish
inteles
ian
posibile
imports
plata
aflam
signal
culturii
exercise
luka
inclusion
rel@@
negociere
ry
sustinem
offered
allowing
intalnire
membrilor
sports
valoarea
deosebita
severe
granita
scara
preveni
hopes
directie
larg
ary
ideas
circulatie
lansarea
getting
bas@@
unable
obtina
cheltuielile
inceapa
dificultati
thought
prison
happy
alianta
activitatilor
traficul
sistemelor
privat
reading
produced
fraud
launch
acordata
intalnirea
tin
ocupa
din@@
hours
bro@@
regulatory
stockholm
educatiei
reprezentantul
pension
djindjic
rurale
palestinian
armatei
sv
vreau
durabile
ambassador
sisteme
avertizat
efectuate
analysis
indeplineasca
employees
orientul
don
heads
broad
ins
exprima
signing
intreb
dificile
focused
papandreou
devine
sec@@
mentionez
radical
deschisa
organizatiile
fear
incep
confirmat
concluded
ance
sute
opozitia
atiei
stabilisation
suffering
continuarea
drumul
taxe
totala
joaca
pre
desfasoara
ecologice
mic
gotovina
semnificativa
colleague
abila
sprijinim
amendamentul
ari@@
limit
crimei
numarului
ven@@
protectiei
promotion
cas@@
atiilor
criterii
evenimentele
dezbaterii
multi@@
ended
comunitare
partenerii
completed
obligatia
2014
semnal
bazata
fa@@
ministerului
sen@@
individuals
-@@
implicati
dan@@
moving
considerable
west
pipeline
neighbouring
continent
alde
castiga
communist
ek@@
presidential
atinge
sol@@
exactly
networks
mana
estimated
candidates
reprezentat
intregul
seara
thinking
determina
reglementari
provocare
constienti
violentei
principale
protected
pregatita
informed
victimele
annan
completa
urge
cro@@
fil@@
emis
dam
win
grav
egypt
ise
released
frontex
inchisoare
truly
construirea
ch
subiectul
urban
alisation
planului
animals
consens
defend
colegilor
experti
gave
yugoslav
vehicles
end@@
ger@@
noii
significantly
ge@@
abroad
pretul
150
expenditure
became
resolved
reduse
ultimately
bur@@
finantelor
statistics
efort
heart
dra@@
front
tratament
traffic
devreme
ep
placed
atingerea
eri@@
built
appeal
raportorului
offers
vechi
riscul
luata
urmatorii
ding
sis
weapons
hear
interested
republika
deschide
oare
honourable
consistent
warned
negativ
pet@@
ovski
ici
places
stabilizare
ohrid
sensitive
met@@
egalitatea
practic
aveti
competitivitatea
conventia
temeiul
trai
evenimente
useful
plati
urmat
formarea
millions
medi@@
evaluation
chairman
consecinte
mitrovica
remind
evenimentul
gestionare
grupurilor
accepted
heritage
apara
tool
punere
enforcement
contrary
facilities
votului
publicat
reguli
tranzitie
deputatilor
preturile
ashdown
folosite
als
legale
interese
content
premiul
exports
schimbul
ps
den@@
constructia
fiscala
inaltul
bh
creeaza
independentei
militar
respectiva
obtain
consumatori
studiu
profesionala
ilegal
stream
alineatul
involving
disasters
publicului
executive
regimul
serviciu
autoritatea
sarbii
eveniment
documente
restrictions
spatiul
incercam
lungul
putine
capitala
continuam
strainatate
intregii
compliance
utilizarii
range
greatest
reaching
inchisa
decades
airlines
easier
anterioare
producatorii
danube
requirement
por@@
actioneze
incheie
partidelor
conflictului
judiciary
prospects
redus
pac
arme
obligation
peaceful
stricte
incerca
spori
solve
sectoare
costurilor
animale
joined
phase
release
atic
port
nevoile
tehnologii
55
razboiului
ire
adjustment
ase
factors
deputat
ieri
neighbourhood
ba
expertii
sanctiuni
decisive
izarea
ru
hundreds
tia
ect@@
estul
guvernare
constitutionale
nr
adopting
monitorizarea
bad
ministrului
intrat
acuzat
file
convins
combatere
japonia
documentul
instance
opposed
procedurii
afganistan
regiunilor
reusi
safeguard
ini
imposed
vina
tion@@
spunem
sufera
deloc
á@@
obligatiile
word
genuine
beneficii
ke
punctele
delay
administratiei
impuse
dezvoltate
adica
neither
bosniei
extend
mentionate
ard
played
stay
adaugand
vara
medicala
ui
incuraja
ska
irak
kurdish
loss
idee
vorbesc
highlight
comply
candidat
reference
eficientei
locala
please
facilita
tomislav
plenary
acordurilor
intern
form@@
award
straini
globalizare
consumption
taxa
oficiale
provocarile
bosniac
criticism
reuniunea
conditie
atrag
secret
concurentei
greci
actualul
dayton
dangerous
tive
salutat
loans
neighbours
allows
rightly
sporirea
yesterday
itor
reprezentanti
afacerilor
incluse
merge
joining
modalitate
debates
claims
don@@
garanteze
portugalia
tiei
thereby
refugiati
folosit
ies
abdullah
atins
else
payment
cheltuielilor
desfasurat
peoples
improvements
schools
echilibru
lucram
planurile
totalitate
aborda
idei
under@@
judiciar
belgian
inapoi
format
realizate
vin
afectat
revision
vrem
visited
14@@
dimension
tel@@
electrice
option
verde
agriculturii
sejdiu
regatul
stabileasca
sunteti
creeze
colegi
advantage
scheduled
stabileste
potentialul
van@@
conducerea
populatie
happening
inovare
holding
got
correct
cities
metoda
acordam
calitatii
recenta
immigrants
angajati
disease
pensii
ansamblu
radovan
flexibility
out@@
partial
determination
welfare
studies
crvenkovski
causes
contains
economiile
envoy
indica
umanitar
festivalul
drawn
sustainability
dodik
redresare
oara
tie
bancile
politicienii
lines
vecinatate
enormous
strategice
atorul
inter
cat@@
integrate
zeci
ras@@
participe
lies
ls
democratilor
partener
functia
coordinated
primarily
intereselor
regular
stiintifice
senior
reporters
prioritati
respected
stransa
furnizarea
critica
ciprului
incident
remaining
etapa
uni
analysts
paragraph
abuse
condusa
tina
voa
transfrontaliere
officers
spatele
presiuni
pa
actiunea
enti@@
ombudsman
cuts
credibility
fac@@
mandatului
relevante
methods
original
ca@@
sedinta
1st
afecta
stirile
finding
barriers
apararea
acceptable
encouraging
awareness
vizitat
cercetarea
bei
faza
micro@@
ble
taxes
indeaproape
hands
informatiilor
soldiers
fine
stabilitatii
structura
adresez
fish
ised
obvious
discursul
resolutions
é@@
independente
normelor
vision
kov
transportului
actiona
citizen
campania
coordonarea
chestiunile
tin@@
determined
britain
q@@
controls
ajustare
dragan
djukanovic
termeni
principii
manage
utilizat
sali
pret
responsabile
rezolvarea
tone
innovative
der@@
olympic
preventing
bucur
impactului
foundation
educational
charge
ham@@
considerabil
gain
semnarea
oasa
ku@@
procedurilor
believes
fail
men@@
1998
bear
expert
suggested
anniversary
urmatoare
personally
datele
cazurile
ig@@
conduct
teroriste
bosniaci
primeasca
viitorului
ecr
tried
descarcarea
mijloacele
threats
muslim
includa
educatia
stiri
sovereignty
distribution
bul@@
angajamentele
comise
iei
ev
locurilor
participants
1991
art
opozitiei
eliminate
ve@@
ter
hal@@
ga@@
accused
fundamentala
var@@
modificari
ron@@
method
vladimir
read
combate
solicitarea
split
1,@@
pusa
programelor
inalta
reduca
baroness
sigurantei
loan
amenintare
os@@
forme
bri@@
gaz
balcanice
accesului
expectations
worst
viza
cineva
associated
vat
lunga
voiced
sound
department
fuel
reconstruction
turned
fatmir
irea
ajute
pointed
ment@@
productiei
exprimare
obstacles
effectiveness
fulfil
treia
34
65
defined
sedintei
fur@@
coruptie
learn
companie
ence
arctic
serviciului
strategica
savings
netherlands
prepare
agentii
cifra
space
dau
elimina
drug
alegerea
ash@@
dor@@
imbunatatire
ek
recommendation
impossible
speci@@
swift
merkel
institutie
cunoscut
egal
pregatit
trimis
comunicare
strategies
rompuy
dincolo
modificare
designed
anilor
erilor
shadow
referred
mijloace
pregatiti
ere@@
anumita
industrie
lose
iceland
diplomatice
details
corecte
punerii
transactions
bush
droguri
commander
ze
interesate
socialists
processes
ak
legislativa
tor@@
courts
attended
id
tinand
concluziile
tehnologie
criticat
material
digital
imagine
sarace
exploitation
parliaments
accepte
dimineata
oferite
acceptat
intentia
insurance
equally
prior
aduse
firmly
ese
atrage
chinese
par
ut
carei
pensions
ü@@
gaseasca
numit
16@@
definitely
atras
emisiile
britanic
generally
sing
armate
worse
prevazute
ceilalti
ran@@
ez@@
spatiu
explained
amendament
aplicate
incalcare
ceremony
2015
linda
cercetarii
astept
asigurari
serioase
extreme
cauta
nefericire
scena
primului
ful
1.@@
supravegherea
games
plateasca
facuta
votez
primary
explicat
frontiera
condition
inacceptabil
taxpayers
10@@
dj@@
proiectelor
strengthened
conducere
sosit
acordate
sim@@
tests
mid
lucratori
ler
spoke
universal
angajat
includerea
represented
incercarea
bugetara
componenta
enjoy
faces
trading
turism
paul
oferim
facility
formare
ms
pal@@
15@@
tro@@
formal
succesul
transmite
om
schimbat
bre@@
tribunalului
historic
lucreze
waiting
capable
ean
aza
turi
tul
rusiei
iranian
declared
acel
permanenta
reflect
mereu
contributions
paris
eib
ure
topic
pt@@
ministri
infrastructurii
croati
veni
gaddafi
demonstrated
procurement
collective
pacientilor
intreg
libere
entity
electorale
considerata
jevic
federation
dic@@
incantat
adaugata
promised
solutia
inde@@
sporita
link
gasim
thirdly
diversity
medicines
garantarea
proprii
costuri
emb@@
liberalizarea
repeat
someone
gasit
addressing
considering
actionam
victory
cuba
ete
crises
directives
simt
base
post@@
nic@@
numbers
determine
prosecutors
misiunii
fran@@
rising
alleged
card
adresata
excessive
oc@@
lucrat
gandim
planuri
descris
competitivitatii
existence
oras
changing
goran
obligatoriu
perfect
scheffer
les
enti
the@@
industries
21st
alism
preparing
crestin
hoop
finantarii
responsabila
teren
coerenta
bunuri
vorbi
folosi
vuk
600
bazate
extended
allocated
deciziilor
deschise
ality
interiorul
presiune
introducing
claim
legaturi
traian
gasirea
applies
closure
nikolic
opinie
players
demonstrate
guaranteed
skills
competence
36
prosperity
degree
cancer
iugoslavie
cel@@
apropiat
figure
ecologica
esti
pasagerilor
declaratiile
letter
intend
utilizare
pedeapsa
stra@@
jurul
coasta
purposes
laid
caracter
intelegere
disputa
dr@@
studii
comunicarea
atacuri
modificarea
ö@@
intelege
rl
universitatea
regenerabile
stri@@
juca
consultation
impose
regim
parteneriatul
rfe
pass
covered
cream
operators
vizitei
industriale
suferit
acting
runda
treaties
turca
auto@@
electricitate
criticised
cerere
adera
morning
niveluri
solid
gen@@
croata
civilian
urgently
alocate
turismului
suficienta
parents
saracie
tva
scheme
sugereaza
arestarea
agricol
motivele
comment
duties
statut
lumina
merely
surselor
kal@@
adevarata
divided
myself
track
declarand
ord@@
carefully
adere
organizatiilor
bra@@
ativa
keeping
urmareste
legally
identity
profesionale
fostului
redusa
hertegovinei
conditia
ambasadorul
explain
carta
dic
karamanlis
sarkozy
penalty
vize
implicat
intention
tem@@
reportedly
albaneze
nivelurile
inclus
principiului
croate
mesajul
anumit
materials
ked
atac
aur
lju@@
dialogului
hashim
temporary
stake
parlamentar
truth
aplice
multumit
ngos
eurozone
agentiile
ner
alternativa
ker
alo@@
targeted
submit
harmonisation
consta
refugiatilor
biodiversity
minim
ocuparii
inregistrate
lectura
cuprinzatoare
cars
playing
sion
insist
comparatie
realise
alul
judges
worldwide
helped
maintaining
3.@@
activa
aparut
referire
doamnei
housing
tiile
saw
costa
dimensiunea
promoveze
adauga
egipt
acte
friendly
mentioneaza
pun
lucra
reformei
a.
depuna
wo@@
stat@@
seem
grant
identified
imbunatateasca
dezvolte
venituri
250
television
campanie
aviation
sugerat
creasca
parteneri
tan@@
adoptam
showed
reglementarea
dist@@
gro@@
contributed
transporturilor
religion
prove
reliable
insemna
rapoartele
requested
discriminare
employed
double
emphasis
pra@@
crearii
haideti
collection
rich
egf
entirely
800
regulile
judiciare
remarks
parlamentara
atului
coruptia
conflictul
comisii
sets
luarea
murder
ilegala
ute
sarbilor
highlighted
jeremic
assess
ves
spiritul
finances
bill
committees
fire
church
prize
itoare
friends
vi
sad
analizam
choose
concentreze
street
appear
legitimate
sive
32
ade@@
reasonable
stabilim
died
desire
deliver
turcesti
legat
apart
compensation
consolidate
obligatorii
lithuania
milorad
recunoastem
austerity
5th
und@@
up@@
technological
generate
assist
hamas
actiunilor
import
paying
demanding
suffered
recomandarile
pres@@
13@@
leaving
unless
running
condamnat
largely
belgium
charged
arta
aduca
solicitare
schimbarea
successfully
casa
joace
exhibition
zero
book
kon@@
reporterilor
historical
suggest
gal@@
incalca
emisii
brazil
bancar
division
milk
ach@@
efortul
eta
we@@
determinat
inovatoare
albaneza
contracts
00@@
code
cri@@
ingrijorare
pledged
simpla
importanti
refuzat
of@@
alizare
arrived
concentram
previously
colaborare
asistentei
users
sit
obtinute
compar@@
banci
involve
efectuat
ends
propriul
wait
ben@@
dutch
decenii
viitoarea
provocat
insista
theatre
bazat
oz@@
eficace
diferita
biroul
exceptional
eau
mir@@
labelling
autoritati
balcanilor
assets
grounds
deseurilor
familie
behaviour
alizarea
sigure
proceedings
17@@
professor
reamintesc
societati
slovakia
specifica
mecanisme
realitatea
geneva
survey
arul
antonio
publicul
danger
whilst
sustina
raspunda
soldati
korea
languages
guvernelor
sought
politically
visas
vamale
consolideze
diferit
egalitatii
hu@@
dependenta
berlin
honour
luand
precise
jan
attitude
far@@
executiv
puteri
eni@@
includ
ambitios
guvernamentale
unfair
ahmet
eti@@
acasa
identify
teritoriala
internationali
e.
48
monetare
interim
pilot
sudul
arestat
tasks
tools
scadere
folosesc
postul
limits
fields
introdus
sovereign
curent
pozitii
reze
losses
familiile
adjunct
depusa
federal
transatlantic
difference
49
offering
brings
ying
lea@@
ical
resulting
pregatirea
generation
nik
aduc
arab
datoriei
hel@@
regardless
forthcoming
ste
heavy
depends
viol@@
semn
georgi
room
save
raising
menite
malmström
opinions
ajutorului
comunitatilor
suffer
interesting
standing
ants
apropiere
perspectivele
ors
branko
wing
hdz
indicated
gue
gone
argument
web
20th
multilateral
centres
votare
acta
felul
commissioners
registered
enhanced
stands
pactul
approximately
clause
deep
sweden
baltic
primesc
politicieni
uz@@
somajul
emerging
sigura
33
respectate
cerinte
provin
pic@@
electorala
naturally
beta
rare
hotarat
cuprinde
entities
firms
decent
stations
lideri
tourists
util
kingdom
ably
deficitul
incalcarea
eye
sanse
jel@@
furniza
cipriot
ordine
protests
depune
reciproc
europol
tilor
irii
cru@@
ordinary
mentinere
concluzie
realistic
infiintat
warning
festivalului
progresele
folosirea
push
votarea
mentina
procurorul
modului
evidenta
guantánamo
proprietate
jean
diseases
garantii
centrului
simplificarea
continutul
120
foloseasca
misiune
granitele
contrar
actively
forte
jos
efecte
mobilizarea
ivan
flexible
increases
explica
ton
factori
succeed
10th
examples
diferitelor
seeks
dealt
articolului
inchiderea
evenimentelor
rurala
municipalities
ators
culturala
prezentata
football
tica
treated
reactie
gresit
drum
trecere
construi
colegul
orii
attempts
extension
sort
showing
med
block
neg@@
grad
comunitati
isti
gap
supuse
regulate
alitatea
comerciala
televiziune
audit
kov@@
poarta
imbunatatiri
register
asume
vel@@
entei
author
miscare
cetatean
detailed
stock
tariceanu
beneficiaza
willing
powerful
comitetului
holds
neagra
vol@@
tendinta
&apos;@@
saracia
dramatic
london
massive
oportunitatea
estimeaza
buy
floor
pierde
resulted
karadaku
migrants
exclusion
desfasurare
beijing
stau
subsidies
egalitate
confirm
actor
dezastru
inflation
mir
scopuri
fiecarui
43
javier
lasa
pacea
stance
resolving
supplies
scoala
mun@@
inaintat
imprumut
cooperate
intrerupt
diferenta
milan
homes
respectul
dependent
officially
medicamente
progresului
deadline
sesiune
5m
conferintei
ici@@
umana
natasa
radic
sincer
museum
break
star@@
ending
minime
settlement
instituirea
voluntary
exclusiv
familiei
periculoase
vis@@
atitudine
afectati
oper@@
transforma
fast
vecine
americane
istoric
sites
learning
unilateral
becomes
violation
12th
reuniune
preconizeaza
aflata
altceva
airport
confirma
totally
raportoare
gold
opiniile
adresat
directa
ambitioase
substances
francez
civilians
advance
complicated
sectoarele
responsabili
orase
restructuring
impartasesc
obstacol
tipuri
sy@@
enhance
seats
mostly
4.@@
violent
parvanov
dignity
spokesman
alitate
sudan
comunitara
documentele
negotiation
organizatie
teama
anuale
manuel
reciproca
ratification
arms
retele
astepta
proposing
interventie
kept
moral
unity
size
inaltului
competentele
dura
tele
liber@@
considerate
personale
veniturile
decade
links
salvare
ons
novi
principiilor
feg
israeli
lucrarile
austeritate
ada
brazilia
door
guverne
turismul
recomandari
alocat
drugs
controversial
sharing
interview
cealalta
forest
bit
applying
promoveaza
relatia
excelent
interinstitutional
purtatorul
guaranteeing
village
plays
constitutia
od@@
abordam
prezenti
adi@@
declare
options
indu
tehnica
recession
missing
vicepresedintele
autor
apropierea
lam@@
viz@@
genocide
imediata
prezidentiale
vulnerabile
lajcak
implice
mayor
speculation
locali
ste@@
aw@@
owned
observat
valorilor
amounts
georgiev
6th
700
reteaua
comp@@
propusa
integrata
spend
appears
reduceri
dovezi
suitable
seeing
coreea
hiv
credite
imbunatatit
cata
saluta
structurile
ridicata
approve
carrying
gn@@
fourth
below
sfera
chair
log@@
obstacole
prisoners
ohr
judge
bancilor
lituania
residents
ets
doha
sri
involves
interviu
war@@
participating
med@@
ajungem
ferma
grateful
partilor
maniera
umanitare
malta
bg
abtinut
tal@@
granting
chosen
reject
handicap
progressive
verts
anticipate
contra@@
ann@@
povara
alzheimer
mediterana
exercita
sold
meat
00
mobilisation
44
entered
nastere
nea@@
electronice
exploatarea
42
ocupare
escu
legala
acuzatiile
governing
marine
usa
viziune
answers
capit@@
pescuitul
hor@@
species
yemen
murit
maritim
uniform
na@@
monedei
reconciliation
stipe
wto
descoperit
mul@@
modelul
import@@
suplimentara
1990s
served
euobserver
serioasa
niste
initiativele
3rd
imigranti
ingrijorarea
ered
martti
lan@@
proved
surveillance
buckovski
imprumuturi
lis@@
sem@@
acopera
presiunea
ass@@
pollution
put@@
pasi
15th
autonomy
host
estic
spoken
slovacia
macro
libertatilor
atilor
polish
exceptia
born
barnier
beneficieze
lastly
cypriots
polls
2.@@
socio
valabil
perioade
iata
ecti@@
woman
suedia
beneficiul
refuza
depasi
di
exists
spring
belgradului
false
creative
evaluate
organiza
chain
rail
granitelor
formul@@
felt
cin@@
supra@@
alist
alege
sustinuta
consequently
definition
belgia
delighted
consolidare
coeziunea
significance
0.@@
reporting
ation@@
fbih
deciziei
missions
altul
comitetul
grecesti
referinta
river
termenul
conce@@
ess
nica
function
ei@@
alegatorii
ships
ear@@
replace
discriminarii
whatever
transferul
depend
moscow
celorlalte
4,@@
delegatia
mic@@
prevenire
evening
located
vremuri
tem
facand
subiecte
utilizeaza
inform
drawing
universities
omc
capacitatii
islanda
opinii
bio@@
unile
integrity
night
ric@@
interimar
operatiunile
prevederile
unemployed
stan@@
gazprom
meant
trimite
criteriilor
dispozitia
financed
tranzactiile
tehnic
match
experienced
jocurile
7th
coalitie
atacurile
remove
utiliza
requests
turning
criminals
examine
christians
representation
profund
subsidiarity
preocuparile
aplicarii
metode
4th
telekom
tinut
affecting
psd
coopereze
core
applications
numirea
rapide
occurred
valuable
destinat
protejeze
exemple
feed
dur@@
personalului
strike
intalniri
reuniunii
justified
cheltuieli
marile
51
85
leads
summitului
qaeda
indicat
nis
oppose
sensul
conflictelor
rezistenta
eliberarea
8th
abia
ke@@
esenta
mann
coalitia
bunastarea
46
mc@@
himself
electric
editie
imposibil
dimpotriva
kr@@
privatizare
vizite
ex
nationals
raportorilor
spread
banja
wall
egala
producatorilor
preturi
ze@@
americii
amending
comunitate
extinde
comunitatile
presidents
egale
romani
fat@@
white
alitatii
insula
ou
tpii
upcoming
schulz
sil@@
sions
proud
0
camp
nec@@
scazute
tackling
entitled
absenta
den
acuzatii
procesele
37
95
talat
reglementarile
alt@@
0,@@
receiving
advertising
reaction
abordari
vis
abstained
salutam
indeplinit
nivelului
obligatorie
medie
abordeze
functioneze
grija
tensions
investeasca
ismul
mag@@
obicei
happens
mecanismul
ajutam
rele
unesco
intends
penale
marks
types
riscuri
syria
marina
rezerva
section
bazeze
inceperea
rezerve
vari@@
provincia
detalii
suspects
raspunsuri
ros
sedinte
intre@@
viitoarele
dati
efectiv
penalties
solidaritatii
marking
electrica
texts
ages
relativ
asi@@
pofida
í@@
simplification
player
condemn
tonnes
diferentele
adevarul
costul
scurta
isa
sam@@
experiencing
47
proposes
ists
healthy
soci@@
dro@@
negotiated
image
structuri
evalua
ativ
iste
instanta
anuala
club
ously
obtinem
marked
congo
abilitatea
scandal
def@@
competent
hearing
romilor
representing
atorului
acuzati
deb@@
revenue
sincere
tului
parti@@
pursue
observa
contributing
weak
refugee
stakeholders
repetat
parteneriatului
dp
mur@@
provocarilor
echitabil
vic@@
hence
believed
cruciala
sion@@
promises
numita
amintim
2nd
lit@@
taxation
realizeze
clean
battle
route
concentrat
opun
stocks
mother
driving
garanteaza
intentions
latter
liderilor
institutul
version
eng@@
comandantul
boala
generalul
firma
rolului
wishes
yo@@
supervisory
pon@@
+
25@@
erile
atele
posibilul
micro
transmis
oferta
auto
istorie
institutionale
flexibilitate
responsabilitatile
trafic
bon@@
ill@@
geographical
referring
indictees
ki@@
economiilor
bearing
define
comisarului
fiu
lo
emphasised
joc
disposal
carne
arrangements
passenger
cadrului
wealth
speakers
reprezentantilor
londra
asociate
wage
mijloc
credibilitatea
deosebire
protectionism
christofias
ought
